Autodesk.Revit.DB.Mechanical.Duct.IsLevelId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given element id is valid level element.
document:
The document.
levelId:
ElementId of the level to check.
Returns:
True if given level id is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Mechanical.Duct.IsDuctTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid duct type.
Remarks:
A type is valid for duct if it can be used to the duct element.
document:
The document.
ductTypeId:
ElementId of the duct type to check.
Returns:
True if duct type can used for this duct, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Mechanical.Duct.IsHvacSystemTypeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks if given type is valid HVAC system type.
document:
The document.
systemTypeId:
ElementId of the HVAC system type to check.
Returns:
True if the given systemTypeId is the HVAC system type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.Duct.SetSystemType(Autodesk.Revit.DB.ElementId)
Updates the associated system type for the duct.
Remarks:
If the duct previously did not have a system associated to it, this will create a new system.
systemTypeId:
The ElementId of the hvac system type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2017

Autodesk.Revit.DB.Mechanical.Duct.CreatePlaceholder(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new placeholder duct.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the duct type.
levelId:
The level id for the duct.
startPoint:
The first point of the placeholder line.
endPoint:
The second point of the placeholder line.
Returns:
The created placeholder duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The duct type ductTypeId is not valid duct type.
-or-
The ElementId levelId is not a Level.
-or-
The points of startPoint and endPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.Duct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Creates a new duct that connects to two connectors.
Remarks:
The new duct will have the same diameter and system type as the start connector. The creation will also connect the new duct
to two component who owns the specified connectors. If necessary, additional fitting(s) are included to make a valid connection.
If the new duct can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new duct
will still be created at the specified connector position, and an InvalidOperationException is thrown.
document:
The document.
ductTypeId:
The ElementId of the new duct type.
levelId:
The level ElementId for the new duct.
startConnector:
The first connector where the new duct starts.
endConnector:
The second point of the new duct.
Returns:
The created duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The duct type ductTypeId is not valid duct type.
-or-
The ElementId levelId is not a Level.
-or-
The connector's domain is not Domain.​DomainHvac.
-or-
The points of startConnector and endConnector are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the new duct fails to connect with the connector.
Since:
2017

Autodesk.Revit.DB.Mechanical.Duct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ)
Creates a new duct that connects to the connector.
Remarks:
The new duct will have the same diameter and system type as the specified connector. The creation will also connect the new duct
to the component who owns the specified connector. If necessary, additional fitting(s) are included to make a valid connection.
If the new duct can not be connected to the next component (e.g., mismatched direction, no valid fitting, and etc), the new duct
will still be created at the specified connector position, and an InvalidOperationException is thrown.
document:
The document.
ductTypeId:
The ElementId of the new duct type.
levelId:
The level id for the new duct.
startConnector:
The first connector where the new duct starts.
endPoint:
The second point of the new duct.
Returns:
The created duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The duct type ductTypeId is not valid duct type.
-or-
The ElementId levelId is not a Level.
-or-
The connector's domain is not Domain.​DomainHvac.
-or-
The points of startConnector and endPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the new duct fails to connect with the connector.
Since:
2017

Autodesk.Revit.DB.Mechanical.Duct.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new duct from two points.
document:
The document.
systemTypeId:
The id of the HVAC system type.
ductTypeId:
The id of the duct type.
levelId:
The level ElementId for the duct.
startPoint:
The start point of the duct.
endPoint:
The end point of the duct.
Returns:
The created duct.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The systemTypeId is not valid HVAC system type.
-or-
The duct type ductTypeId is not valid duct type.
-or-
The ElementId levelId is not a Level.
-or-
The points of startPoint and endPoint are equal.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2014

Autodesk.Revit.DB.Mechanical.Duct.IsPlaceholder
Identifies if the duct is a placeholder or not.

Autodesk.Revit.DB.Mechanical.Duct.DuctType
The duct type of this duct.

Autodesk.Revit.DB.Mechanical.Duct
A duct in the Autodesk Revit MEP product.
Remarks:
The duct is only available in the Autodesk Revit MEP product.